/**
 * @file crc32.h
 * @author Шанин А.М. (dnega@mail.ru)
 * @brief Заголовочный файл библиотеки расчета CRC32.
 * @version 0.1
 * @date 20.05.2016
 * 
 * @copyright Copyright (c) 2023
 * 
 */
#ifndef __CRC32_H__
#define __CRC32_H__

/******************************************************************************
 * INCLUDE
 *****************************************************************************/
#include "type.h"

/******************************************************************************
 * DEFINE
 *****************************************************************************/

/******************************************************************************
 * FUNCTION
 *****************************************************************************/
//-----------------------------------------------------------------------------
//! \fn extern DWORD crc32(const BYTE *buf, DWORD len)
//! \brief Вычислить CRC32 для буфера buf размером len.
//! \param buf Адрес буфера.
//! \param len Размер буфера в байтах.
//! \return Значение CRC32 для блока.
//-----------------------------------------------------------------------------
extern DWORD crc32(const BYTE *buf, DWORD len);

//-----------------------------------------------------------------------------
//! \fn extern DWORD crc32_init(DWORD *crc_value)
//! \brief Инициализация переменной CRC32.
//! \param crc_value Адрес переменной CRC32.
//! \return Значение переменной CRC32.
//-----------------------------------------------------------------------------
extern DWORD crc32_init(DWORD *crc_value);

//-----------------------------------------------------------------------------
//! \fn extern DWORD crc32_next(DWORD *crc_value, const BYTE *buf, DWORD len)
//! \brief Вычислить порцию CRC32 для буфера buf размером len.
//! \param crc_value Адрес переменной CRC32.
//! \param buf Адрес буфера.
//! \param len Размер буфера в байтах.
//! \return Значение CRC32 для блока.
//-----------------------------------------------------------------------------
extern DWORD crc32_next(DWORD *crc_value, const BYTE *buf, DWORD len);

/******************************************************************************
 * VARIABLE
 *****************************************************************************/

#endif // __CRC32_H__
/******************************************************************************
 * КОНЕЦ ФАЙЛА
 *****************************************************************************/
