/**
 * @file font.h
 * @author Шанин А.М. (dnega@mail.ru)
 * @brief Заголовочный файл шрифтов.
 * @version 0.1
 * @date 20.05.2016
 * 
 * @copyright (C) Ярославль, 2016
 * 
 */
#ifndef	__FONT_H__
#define	__FONT_H__

/******************************************************************************
 *	INCLUDE
 *****************************************************************************/
#include "type.h"

/******************************************************************************
 *	DEFINE
 *****************************************************************************/
//-----------------------------------------------------------------------------
//! \typedef struct sFONT_ITEM
//! \brief Элемент шрифта
//! \struct sFONT_ITEM
//! \brief Элемент шрифта
//-----------------------------------------------------------------------------
typedef struct sFONT_ITEM
{
	DWORD				width:8;				//!< Ширина символа
	DWORD				position:23;		//!< Смещение символа
	DWORD				flag:1;					//!< Флаг отсутствия зазора
} sFONT_ITEM;

//-----------------------------------------------------------------------------
//! \typedef struct sFONT
//! \brief Заголовок шрифта
//! \struct sFONT
//! \brief Заголовок шрифта
//-----------------------------------------------------------------------------
typedef struct sFONT
{
	BYTE				height;					//!< Высота шрифта
	BYTE				version;				//!< Версия шрифта
	WORD				size;						//!< Число символов в шрифте
	BYTE				name[12];				//!< Имя шрифта
	sFONT_ITEM	item[256];			//!< Массив элементов шрифта
} sFONT;

/******************************************************************************
 *	FUNCTION
 *****************************************************************************/

/******************************************************************************
 *	VARIABLE
 *****************************************************************************/
extern const BYTE	Font_Single[];	//!< Шрифт высотой 8 точек
extern const BYTE font9[];				//!< Шрифт высотой 9 точек

#endif // __FONT_H__
/******************************************************************************
 * КОНЕЦ ФАЙЛА
 *****************************************************************************/
