/**
 * @file hart.h
 * @author Шанин А.М. (dnega@mail.ru)
 * @brief Заголовочный файл HART-протокола.
 * @version 0.1
 * @date 20.05.2016
 * 
 * @copyright (C) Ярославль, 2016
 * 
 */
#ifndef __HART_H__
#define __HART_H__

/******************************************************************************
 * INCLUDE
 *****************************************************************************/
#include "define.h"
#include "type.h"

/******************************************************************************
 * DEFINE
 *****************************************************************************/
#define HART_TX_BUF				(128)						//!< Размер буфера передатчика HART
#define TO_HART						(1000UL)				//!< Таймаут активности HART, мс
#define HART_ID						(image.serial)	//!< Серийный номер устройства
#define HART_SENSOR_ID		(image.serial)	//!< Серийный номер сенсора
#define TO_HART_ACT				(3)							//!< Таймаут активного режима, тик

/******************************************************************************
 * FUNCTION
 *****************************************************************************/
//-----------------------------------------------------------------------------
//! \fn extern void hart_init(void)
//! \brief Инициализация HART
//-----------------------------------------------------------------------------
extern void hart_init(void);

//-----------------------------------------------------------------------------
//! \fn extern void hart_on_rx(const BYTE x)
//! \brief Новый символ принят по HART
//! \param x Принятый символ
//-----------------------------------------------------------------------------
extern void hart_on_rx(const BYTE x);

//-----------------------------------------------------------------------------
//! \fn extern int hart_on_tx(BYTE *x)
//! \brief Передать символ из буфера передатчика HART
//! \param x Указатель на переменную очередного символа
//! \return Статус выполнения:
//! - 0 - буфер передатчика пуст
//! - 1 - символ загружен
//-----------------------------------------------------------------------------
extern int hart_on_tx(BYTE *x);

//-----------------------------------------------------------------------------
//! \fn extern void hart_start_tx(const int size)
//! \brief Начать передачу пакета HART
//! \param size Размер пакета
//-----------------------------------------------------------------------------
extern void hart_start_tx(const int size);

//-----------------------------------------------------------------------------
//! \fn extern void hart_timer(void)
//! \brief Функция таймера HART
//-----------------------------------------------------------------------------
extern void hart_timer(void);

//-----------------------------------------------------------------------------
//! \fn extern void hart_str(BYTE *dst, BYTE *src, int size)
//! \brief Преобразовать строку к HART-формату строк (упаковка)
//! \param dst Буфер назначения
//! \param src Исходная строка
//! \param size Размер буфера назначения
//-----------------------------------------------------------------------------
extern void hart_str(BYTE *dst, BYTE *src, int size);

extern void hart_send_act(void);

/******************************************************************************
 * VARIABLE
 *****************************************************************************/
extern tTIMER to_hart;										//!< Таймер активности HART
extern tTIMER to_hart_act;								//!< Таймаут активного режима, тик
extern volatile float	hart_ext_current;		//!< Значение тока HART, мА

#endif // __HART_H__
/******************************************************************************
 * КОНЕЦ ФАЙЛА
 *****************************************************************************/
