/**
 * @file init.h
 * @author Шанин А.М. (dnega@mail.ru)
 * @brief Заголовочный файл инициализации периферии.
 * @version 0.1
 * @date 20.05.2016
 * 
 * @copyright (C) Ярославль, 2016
 * 
 */
#ifndef __INIT_H__
#define __INIT_H__

/******************************************************************************
 * INCLUDE
 *****************************************************************************/
#include "stm32l1xx.h"
#include "isr.h"
#include "type.h"

/******************************************************************************
 * DEFINE
 *****************************************************************************/
//-----------------------------------------------------------------------------
//! \enum eRCC_STATE
//! \brief Состояния схемы PLL.
//-----------------------------------------------------------------------------
enum eRCC_STATE
{
	RCC_STATE_HSI = 0, //!< Состояние "Внутренний источник частоты".
	RCC_STATE_HSE_ON,  //!< Состояние "Включить внешний кварцевый резонатор".
	RCC_STATE_PLL_ON,  //!< Состояние "Включить цепь PLL".
	RCC_STATE_PLL,	   //!< Состояние "Работа от PLL".
	RCC_STATE_TO	   //!< Состояние "Таймаут включения".
};

/******************************************************************************
 * FUNCTION
 *****************************************************************************/
//-----------------------------------------------------------------------------
//! \fn extern void init_CLK(void)
//! \brief Переинициализация периферийных блоков для новой частоты.
//-----------------------------------------------------------------------------
extern void init_CLK(void);

//-----------------------------------------------------------------------------
//! \fn extern void init_SYSTEM(void)
//! \brief Инициализация системы источников частоты.
//-----------------------------------------------------------------------------
extern void init_SYSTEM(void);

//-----------------------------------------------------------------------------
//! \fn extern void init_GPIO(void)
//! \brief Инициализация системы ввода-вывода.
//-----------------------------------------------------------------------------
extern void init_GPIO(void);

//-----------------------------------------------------------------------------
//! \fn extern void init_SYSTICK(void)
//! \brief Инициализация системного таймера.
//-----------------------------------------------------------------------------
extern void init_SYSTICK(void);

//-----------------------------------------------------------------------------
//! \fn extern void init_USART1(void)
//! \brief Инициализация последовательного порта USART1 (консоль).
//-----------------------------------------------------------------------------
extern void init_USART1(void);

//-----------------------------------------------------------------------------
//! \fn extern void init_NVIC(void)
//! \brief Инициализация контроллера прерываний.
//-----------------------------------------------------------------------------
extern void init_NVIC(void);

//-----------------------------------------------------------------------------
//! \fn extern void init_TIM6(void)
//! \brief Инициализация таймера запуска АЦП.
//-----------------------------------------------------------------------------
extern void init_TIM6(void);

//-----------------------------------------------------------------------------
//! \fn extern void init_TIM3(void)
//! \brief Инициализация таймера для ШИМ электромагнита.
//-----------------------------------------------------------------------------
extern void init_TIM3(void);

//-----------------------------------------------------------------------------
//! \fn extern void init_TIM9(void)
//! \brief Инициализация таймера аналогового выхода.
//-----------------------------------------------------------------------------
extern void init_TIM9(void);

//-----------------------------------------------------------------------------
//! \fn extern void init_USART3(void)
//! \brief Инициализация UART для HART.
//-----------------------------------------------------------------------------
extern void init_USART3(void);

/******************************************************************************
 * VARIABLE
 *****************************************************************************/
extern volatile int rcc_state;	 //!< Состояние PLL.
extern volatile tTIMER rcc_time; //!< Таймер PLL.

#endif // __INIT_H__
/******************************************************************************
 * КОНЕЦ ФАЙЛА
 *****************************************************************************/
