/**
 * @file isr.h
 * @author Шанин А.М. (dnega@mail.ru)
 * @brief Заголовочный файл обработчиков прерываний.
 * @version 0.1
 * @date 20.05.2016
 * 
 * @copyright (C) Ярославль, 2016
 * 
 */
#ifndef __ISR_H__
#define __ISR_H__

/******************************************************************************
 *	INCLUDE
 *****************************************************************************/
#include "init.h"
#include "command.h"

/******************************************************************************
 *	DEFINE
 *****************************************************************************/

/******************************************************************************
 *	FUNCTION
 *****************************************************************************/
//-----------------------------------------------------------------------------
//! \fn extern void RCC_IRQHandler(void)
//! \brief Обработчик прерывания RCC
//-----------------------------------------------------------------------------
extern void RCC_IRQHandler(void);

//-----------------------------------------------------------------------------
//! \fn extern void SysTickHandler(void)
//! \brief Обработчик прерывания SysTick
//-----------------------------------------------------------------------------
extern void SysTickHandler(void);

//-----------------------------------------------------------------------------
//! \fn extern void workled_blink(void)
//! \brief Таймер светодиода "РАБОТА"
//-----------------------------------------------------------------------------
extern void workled_blink(void);

//-----------------------------------------------------------------------------
//! \fn extern void ADC1_IRQHandler(void)
//! \brief Обработчик прерывания АЦП
//-----------------------------------------------------------------------------
extern void ADC1_IRQHandler(void);

//-----------------------------------------------------------------------------
//! \fn extern void TIM6_IRQHandler(void)
//! \brief Обработчик прерывания таймера АЦП
//-----------------------------------------------------------------------------
extern void TIM6_IRQHandler(void);

/// @brief Получить новые данные
/// @param adc_ain Входной токовый сигнал
/// @param adc_pos Данные о положении
/// @param adc_btn Данные о нажатии кнопок
/// @param adc_tmp Данные о температуре окружающей среды.
extern void new_samples(const WORD adc_ain, const WORD adc_pos, const WORD adc_btn, const WORD adc_tmp);

extern void btn_update(const WORD adc_btn);
extern void auto_update(const WORD adc_hmc, const WORD adc_btn);
extern void update_hmc_pos(const int tihmc_adc_s, const int linear_en);

/// @brief Возвращает посчитанное абсолютное положение (в 0,1%) с выключенной линеаризацией.
/// @return Значение абсолютного положения.
extern int get_hmc_pos(void);

/******************************************************************************
 *	VARIABLE
 *****************************************************************************/

#endif // __ISR_H__
/******************************************************************************
 * КОНЕЦ ФАЙЛА
 *****************************************************************************/
