/**
 * @file menu.h
 * @author Шанин А.М. (dnega@mail.ru)
 * @author Мазлов Евгений Александрович (mazlov1989@gmail.com)
 * @brief Заголовочный файл меню.
 * @version 2.1
 * @date 10.03.2023
 *
 * @copyright (C) Ярославль, 2016
 *
 */
#ifndef __MENU_H__
#define __MENU_H__

/******************************************************************************
 * INCLUDE
 *****************************************************************************/
#include "type.h"
#include "define.h"

/******************************************************************************
 * DEFINE
 *****************************************************************************/
#define TO_MENU_START (3000UL) // Таймаут показа начального экрана, мс







/// @brief Режимы и меню (отображение)
enum eMENU_VIEW
{
	/// @brief Стартовый экран
	MENU_VIEW_START = 0,

	/// @brief Основной экран
	MENU_VIEW_HOME,

	/// @brief Инфорежим-1
	MENU_VIEW_INFO_1,

	/// @brief Инфорежим-2
	MENU_VIEW_INFO_2,

	/// @brief Инфорежим-3
	MENU_VIEW_INFO_3,

	/// @brief Ручной режим
	MENU_VIEW_HAND,

	/// @brief Меню "Настройки"
	MENU_VIEW_SETUP,

	/// @brief Меню "Настройки". Редактирование
	MENU_VIEW_SETUP_EDIT,

	/// @brief Меню "Сигнализация"
	MENU_VIEW_SIGNAL,

	/// @brief Меню "Сигнализация". Редактирование
	MENU_VIEW_SIGNAL_EDIT,

	/// @brief Меню "Настройка ИМ"
	MENU_VIEW_IM,

	/// @brief Меню "Настройка ИМ". Редактирование
	MENU_VIEW_IM_EDIT,

	/// @brief Меню "Диагностика"
	MENU_VIEW_DIAG,

	/// @brief Меню "PST-тест"
	MENU_VIEW_PST,

	/// @brief Меню "Высокое трение"
	MENU_VIEW_FRIC,

	/// @brief Меню "Гистограммы
	MENU_VIEW_DIAG_GIST,

	/// @brief Меню "Журнал событий"
	MENU_VIEW_LOG,

	/// @brief Меню "Автонастройка"
	MENU_VIEW_AUTO,

	/// @brief Меню "Инженерный режим"
	MENU_VIEW_SERVICE,

	/// @brief Меню "Трение страгивания"
	MENU_VIEW_LOF,

	/// @brief Меню "Автонастройка по HART"
	MENU_VIEW_HARTAUTO,
};

/// @brief Пункты меню "Настройки"
enum eMENU_SETUP
{
	/// @brief 1. Настройка ИМ
	MENU_SETUP_IM = 0,

	/// @brief 2. Журнал событий
	MENU_SETUP_LOG,

	/// @brief 3. Сигнализация
	MENU_SETUP_SIGNAL,

	/// @brief 4. Диагностика
	MENU_SETUP_DIAG,

	/// @brief 5. HART
	MENU_SETUP_HART,

	/// @brief 6. Дисплей
	MENU_SETUP_DISPLAY,

	/// @brief 7. Ручной режим
	MENU_SETUP_HAND,

	/// @brief Число пунктов
	MENU_SETUP_NUM,
};

/// @brief Пункты меню "1. Настройка ИМ"
enum eMENU_IM
{
	/// @brief Пункт меню "1.1 Калибровка"
	MENU_IM_CALIB = 0,

	/// @brief Пункт меню "1.2 Автонастройка"
	MENU_IM_AUTO,

	/// @brief Пункт меню "1.3 Шкала" (добавить)
	MENU_IM_SCALE,

	/// @brief Пункт меню "1.4 Линеаризация"
	MENU_IM_LINEAR,

	/// @brief Пункт меню "1.5 Диапазон входа"
	MENU_IM_DIAP,

	/// @brief Пункт меню "1.6 Плотное закрытие"
	MENU_IM_HARD,

	/// @brief Пункт меню "1.7 Передаточная хар."
	MENU_IM_HAR,

	/// @brief Пункт меню "1.8 Скорость хода"
	MENU_IM_T_LP,

	/// @brief Пункт меню "1.9 ПИД регулятор"
	MENU_IM_HAND,

	/// @brief Пункт меню "1.10 Экспертные настройки" (добавить)
	MENU_IM_EXPERT,

	/// @brief Пункт меню "1.11 Полный сброс пользовательских настроек"
	MENU_IM_RESET,

	/// @brief Пункт меню "ФНЧ входа" (перенести)
	MENU_IM_LP,

	/// @brief Число пунктов
	MENU_IM_NUM,
};

//-----------------------------------------------------------------------------
//! \enum eMENU_DISPLAY
//! \brief Пункты меню "Дисплей"
//-----------------------------------------------------------------------------
enum eMENU_DISPLAY
{
	MENU_DISPLAY_IM = 0,   // Меню "Единицы ИМ"
	MENU_DISPLAY_AIN,	   // Меню "Единицы входа"
	MENU_DISPLAY_CONTRAST, // Меню "Контрастность"
	MENU_DISPLAY_ROTATE,   // Меню "Поворот экрана"
	MENU_DISPLAY_FILTER,   // Меню "Сглаживание ПК"
	MENU_DISPLAY_NUM,	   // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_HART
//! \brief Пункты меню "HART"
//-----------------------------------------------------------------------------
enum eMENU_HART
{
	MENU_HART_ID = 0, // Меню "Идентификатор"
	MENU_HART_ENABLE, // Меню "Отключение"
	MENU_HART_PRIO,	  // Меню "Приоритет"
	MENU_HART_NUM,	  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_SIGNAL
//! \brief Пункты меню "Сигнализация"
//-----------------------------------------------------------------------------
enum eMENU_SIGNAL
{
	MENU_SIGNAL_AOUT = 0, // Меню "Аналоговый выход"
	MENU_SIGNAL_DOUT1,	  // Меню "Дискретный выход 1"
	MENU_SIGNAL_DOUT2,	  // Меню "Дискретный выход 2"
	MENU_SIGNAL_DOUT3,	  // Меню "Дискретный выход 3"
	MENU_SIGNAL_NUM,	  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_SIGNAL_AOUT
//! \brief Пункты меню "Аналоговый выход"
//-----------------------------------------------------------------------------
enum eMENU_SIGNAL_AOUT
{
	MENU_SIGNAL_AOUT_SIG = 0, // Меню "Сигнал"
	MENU_SIGNAL_AOUT_UP,	  // Меню "Верхний диапазон"
	MENU_SIGNAL_AOUT_DOWN,	  // Меню "Нижний диапазон"
	MENU_SIGNAL_AOUT_MAX,	  // Меню "Максимальный ток"
	MENU_SIGNAL_AOUT_MIN,	  // Меню "Минимальный ток"
	MENU_SIGNAL_AOUT_NUM,	  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_SIGNAL_DOUT
//! \brief Пункты меню "Дискретный выход"
//-----------------------------------------------------------------------------
enum eMENU_SIGNAL_DOUT
{
	MENU_SIGNAL_DOUT_SIG = 0, // Меню "Сигнал"
	MENU_SIGNAL_DOUT_VAL,	  // Меню "Положение"
	MENU_SIGNAL_DOUT_DIR,	  // Меню "Направление"
	MENU_SIGNAL_DOUT_GIS,	  // Меню "Гистерезис"
	MENU_SIGNAL_DOUT_NUM,	  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_IM_CALIB
//! \brief Пункты меню "Калибровка"
//-----------------------------------------------------------------------------
enum eMENU_IM_CALIB
{
	MENU_IM_CALIB_TEST = 0, // Меню "Тест"
	MENU_IM_CALIB_MIN,		// Меню "Минимум"
	MENU_IM_CALIB_MAX,		// Меню "Максимум"
	MENU_IM_CALIB_RST,		// Меню "Сброс времени"
	MENU_IM_CALIB_NUM,		// Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_IM_HAND
//! \brief Пункты меню "ПИД регулятор"
//-----------------------------------------------------------------------------
enum eMENU_IM_HAND
{
	MENU_IM_HAND_KP = 0, // Меню "Пропорциональный Кп"
	MENU_IM_HAND_KI,	 // Меню "Интегральный Ки"
	MENU_IM_HAND_KD,	 // Меню "Дифференциальный Кд"
	MENU_IM_HAND_SAVE,	 // Меню "Сохранить"
	MENU_IM_HAND_INV,	 // Меню "Инвертировать"
	MENU_IM_HAND_SI_OFF, // Меню "Зона накопления И-составляющей"
	MENU_IM_HAND_NUM,	 // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_IM_T_LP
//! \brief Пункты меню "Скорость хода"
//-----------------------------------------------------------------------------
enum eMENU_IM_T_LP
{
	MENU_IM_T_LP_UP,   // Меню "Скорость вверх"
	MENU_IM_T_LP_DOWN, // Меню "Скорость вниз"
	MENU_IM_T_LP_NUM,  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_IM_HAR
//! \brief Пункты меню "Передаточные"
//-----------------------------------------------------------------------------
enum eMENU_IM_HAR
{
	MENU_IM_HAR_PER = 0, // Меню "Передаточная характеристика"
	MENU_IM_HAR_LIM,	 // Меню "Ограничение расхода"
	MENU_IM_HAR_NUM,	 // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_IM_HARD
//! \brief Пункты меню "Плотное закрытие"
//-----------------------------------------------------------------------------
enum eMENU_IM_HARD
{
	MENU_IM_HARD_MIN = 0, // Меню "Минимум"
	MENU_IM_HARD_MAX,	  // Меню "Максимум"
	MENU_IM_HARD_NUM,	  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_IM_DIAP
//! \brief Пункты меню "Диапазон входа"
//-----------------------------------------------------------------------------
enum eMENU_IM_DIAP
{
	MENU_IM_DIAP_MIN = 0, // Меню "Минимум"
	MENU_IM_DIAP_MAX,	  // Меню "Максимум"
	MENU_IM_DIAP_NUM,	  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_OUT_SIG
//! \brief Источники сигнала
//-----------------------------------------------------------------------------
enum eMENU_OUT_SIG
{
	MENU_OUT_SIG_NONE = 0, // Источник "Нет"
	MENU_OUT_SIG_POS,	   // Источник "Положение"
	MENU_OUT_SIG_AIN,	   // Источник "Вход"
	MENU_OUT_SIG_DELTA,	   // Источник "Рассогласование"
	MENU_OUT_SIG_NUM,	   // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_DOUT_DIR
//! \brief Направление дискретного выхода
//-----------------------------------------------------------------------------
enum eMENU_DOUT_DIR
{
	MENU_DOUT_DIR_UP = 0, // Направление "Увеличение"
	MENU_DOUT_DIR_DOWN,	  // Направление "Уменьшение"
	MENU_DOUT_DIR_NUM,	  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_DIAG
//! \brief Пункты меню "Диагностика"
//-----------------------------------------------------------------------------
enum eMENU_DIAG
{
	MENU_DIAG_PST = 0, // Меню "PST-тест"
	MENU_DIAG_FRIC,	   // Меню "Высокое трение"
	MENU_DIAG_GIST,	   // Меню "Гистограммы"
	MENU_DIAG_LOF,	   // Меню "Трение страгивания"
	MENU_DIAG_NUM,	   // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_PST
//! \brief Пункты меню "PST-тест"
//-----------------------------------------------------------------------------
enum eMENU_PST
{
	MENU_PST_DX = 0,  // Меню "Процент хода"
	MENU_PST_T,		  // Меню "Время теста"
	MENU_PST_TE,	  // Меню "Задержка ошибки"
	MENU_PST_AUTORUN, // Меню "Автозапуск"
	MENU_PST_START,	  // Меню "Старт"
	MENU_PST_NUM,	  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_FRIC
//! \brief Пункты меню "Высокое трение"
//-----------------------------------------------------------------------------
enum eMENU_FRIC
{
	MENU_FRIC_DX = 0, // Меню "Рассогласование"
	MENU_FRIC_T,	  // Меню "Время"
	MENU_FRIC_NUM,	  // Число пунктов
};

//-----------------------------------------------------------------------------
//! \enum eMENU_DIAG_GIST
//! \brief Пункты меню "Диагностика"
//-----------------------------------------------------------------------------
enum eMENU_DIAG_GIST
{
	MENU_DIAG_GIST_POS = 0, // Меню "Гистограмма положения"
	MENU_DIAG_GIST_TGT,		// Меню "Гистограмма задания"
	MENU_DIAG_GIST_TMP,		// Меню "Гистограмма температуры"
	MENU_DIAG_GIST_NUM,		// Число пунктов
};

// //-----------------------------------------------------------------------------
// //! \typedef struct sMENU_BTN
// //! \brief Состояние кнопок
// //! \struct sMENU_BTN
// //! \brief Состояние кнопок
// //-----------------------------------------------------------------------------
// typedef struct sMENU_BTN
// {
// 	union
// 	{
// 		BYTE btn; // Общее значение
// 		struct
// 		{
// 			BYTE btn_up : 1;	 // Нажатие "Вверх"
// 			BYTE btn_down : 1;	 // Нажатие "Вниз"
// 			BYTE btn_ok : 1;	 // Нажатие "Ок"
// 			BYTE btn_cancel : 1; // Нажатие "Выход"
// 			BYTE clr_up : 1;	 // Очистка "Вверх"
// 			BYTE clr_down : 1;	 // Очистка "Вниз"
// 			BYTE clr_ok : 1;	 // Очистка "Ок"
// 			BYTE clr_cancel : 1; // Очистка "Выход"
// 		};
// 	};
// } sMENU_BTN;
// Перместил в menu_v2.h

//-----------------------------------------------------------------------------
//! \typedef struct sMENU_VALUE
//! \brief Атрибуты редактируемой переменной
//! \struct sMENU_VALUE
//! \brief Атрибуты редактируемой переменной
//-----------------------------------------------------------------------------
typedef struct sMENU_VALUE
{
	BYTE menu_setup;   // Переменная menu_setup
	BYTE menu_subitem; // Переменная menu_subitem
	WORD none;		   // Не используется
	union
	{
		volatile int *value;	 // Адрес переменной
		volatile float *value_f; // Адрес переменной
	};
	int min; // Минимальное значение
	int max; // Максимальное значение
} sMENU_VALUE;

/******************************************************************************
 * FUNCTION
 *****************************************************************************/

/// @brief Определть нажатые кнопки и обновить состояние меню
extern void menu_update(void);

/// @brief Выполнить отрисовку меню
extern void menu_redraw(void);


#endif // __MENU_H__
/******************************************************************************
 * КОНЕЦ ФАЙЛА
 *****************************************************************************/
