/**
 * @file type.h
 * @author Шанин А.М. (dnega@mail.ru)
 * @brief Типы данных проекта.
 * @version 0.1
 * @date 20.05.2016
 *
 * @copyright (C) Ярославль, 2016
 *
 */
#ifndef __TYPE_H__
#define __TYPE_H__

/******************************************************************************
 *	DEFINE
 *****************************************************************************/
typedef unsigned char BYTE;						//!< Беззнаковый целый 8-бит
typedef unsigned short WORD;					//!< Беззнаковый целый 16-бит
typedef unsigned long DWORD;					//!< Беззнаковый целый 32-бита
typedef volatile unsigned long tTIMER;			//!< Беззнаковый целый 32-бита
typedef volatile unsigned short usart_cr1_type; //!< Тип регистра USART->CR1

//-----------------------------------------------------------------------------
//! \typedef struct sFAULT
//! \brief Формат кадра стека обработчика исключительной ситуации
//! \struct sFAULT
//! \brief Формат кадра стека обработчика исключительной ситуации
//-----------------------------------------------------------------------------
typedef struct sFAULT
{
	DWORD r0;	//!< Регистр R0
	DWORD r1;	//!< Регистр R1
	DWORD r2;	//!< Регистр R2
	DWORD r3;	//!< Регистр R3
	DWORD r12;	//!< Регистр R12
	DWORD lr;	//!< Регистр LR
	DWORD pc;	//!< Регистр PC
	DWORD xpsr; //!< Регистр XPSR
} sFAULT;

#define PIN_NONE (0xFFFF) //!< Вывод не определен
#define NULL ((void *)0)  //!< Несуществующий указатель

//-----------------------------------------------------------------------------
//! \enum eGPIO_PORT
//! \brief Номер порта для вывода
//-----------------------------------------------------------------------------
enum eGPIO_PORT
{
	GPIOA_PORT = 0x00, //!< Порт A
	GPIOB_PORT = 0x10, //!< Порт B
	GPIOC_PORT = 0x20, //!< Порт C
	GPIOD_PORT = 0x30, //!< Порт D
	GPIOE_PORT = 0x40, //!< Порт E
	GPIOF_PORT = 0x50, //!< Порт F
};

//-----------------------------------------------------------------------------
//! \typedef struct sIMAGE_INFO
//! \brief Структура заводских данных
//! \struct sIMAGE_INFO
//! \brief Структура заводских данных
//-----------------------------------------------------------------------------
typedef struct sIMAGE_INFO
{
	DWORD serial; //!< Серийный номер
	DWORD date;	  //!< Дата производства
	DWORD none;	  //!< Резерв
	DWORD crc32;  //!< CRC32 прошивки
} sIMAGE_INFO;

#endif // __TYPE_H__
/******************************************************************************
 * КОНЕЦ ФАЙЛА
 *****************************************************************************/
